# <h1><center>Week 2 Lab (Intro to pandas)</center></h1>
## <h1><center>COSC 3337 Dr. Rizk</center></h1>

### Intro to pandas

Pandas is a high-level data manipulation tool developed by Wes McKinney. It is built on the Numpy package and offers data structures and operations for manipulating numerical tables and time series. Pandas allows us to import data from various file formats such as comma-separated values, JSON, SQL, Microsoft Excel, etc. Throughout the course, we'll be taking advantage of pandas' various data manipulation operations such as merging, reshaping, selecting, as well as data cleaning, and data wrangling features. Just like Numpy, pandas is highly optimized for performance, with critical code paths written in C/C++.

Let's begin by importing pandas and learning about the Series data type. If for some reason you don't have pandas installed, you will first have to go to your terminal (or Anaconda Prompt if on Windows) and enter the following:

    conda install pandas
    
Make sure you've already installed [Anaconda](https://www.anaconda.com/)

In [1]:
import pandas as pd
import numpy as np

### Series

A Series is a one-dimensional labeled array. What this means is that we can now access (index) elements in this array using some assigned labels. We create a Series using ***pd.Series(data, index)***, where data is our array and index is the corresponding labels. Let's see an example below:

In [2]:
my_series = pd.Series(data=[1, 2, 3], index=['A', 'B', 'C'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

In [3]:
my_series = pd.Series(data=[1, 2, 4], index=['A', 'C', 'C'])
print(my_series)

A    1
C    2
C    4
dtype: int64

Since ***my_series*** is of type Series, we can now access the first element in the array in two ways. The usual way we access array elements: ***my_series[0]***, and an additional way using the index labels we assigned: ***my_series['A']***. Try accessing all of the array elements using both methods. See the example below.

In [4]:
print(f"Accessing first element using my_series[0]: {my_series[0]}")
print(f"Accessing first element using my_series['A']: {my_series['A']}")
print(f"Accessing first element using my_series[1]: {my_series[1]}")
print(f"Accessing first element using my_series['B']: {my_series['B']}")
print(f"Accessing first element using my_series[2]: {my_series[2]}")
print(f"Accessing first element using my_series['C']: {my_series['C']}")

Accessing first element using my_series[0]: 1
Accessing first element using my_series['A']: 1
Accessing first element using my_series[1]: 2

KeyError: 'B'

It seems we can access the data, but we can never output the index.

Note that ***data*** can be passed as:
- A Python list (like we saw above)
- A Numpy array
- A Python dictionary

Here's an example of how we would pass a dictionary to ***data***. Since dictionarys already come with key value pairs, there's no need for us to pass index labels.

In [ ]:
my_series = pd.Series(data={'A': 1, 'B': 2, 'C': 3})
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

And here's a Numpy array example:

In [ ]:
my_series = pd.Series(data=np.array([1, 2, 3]), index=['A', 'B', 'C'])
print(my_series)
print(type(my_series))

A    1
B    2
C    3
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
my_series = pd.Series(data=np.array(["meow", "bark", "woof"]), index=['Aa', 'Bb', 'Cc'])
print(my_series)
print(type(my_series))

Aa    meow
Bb    bark
Cc    woof
dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
print(f"my_series['Bb']: {my_series['Bb']}")

my_series['Bb']: bark

***Note: If index labels are not specified for a Series, they will default to [0, n) where n is the number of data values we have. For example:***

In [ ]:
my_series = pd.Series(pd.Series(data=[10, 20, 30]))
print(my_series)
print(type(my_series))

0    10
1    20
2    30
dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
my_series1 = pd.Series(pd.Series(data=[10, 40, 20, 30]))
print(my_series1)

0    10
1    40
2    20
3    30
dtype: int64

What's really cool about Series is that we can perform operations on them, which will be done based off of the index. For example, let's say that I have two Series: ***week_one*** and ***week_two***, both representing how much money I owe my employees for each week.

In [ ]:
week_one = pd.Series(data=[100, 50, 300], index=['Bob', 'Sally', 'Jess'])
week_one

Bob      100
Sally     50
Jess     300
dtype: int64

In [ ]:
week_two = pd.Series(data=[500, 30, 20], index=['Bob', 'Sally', 'Jess'])
week_two

Bob      500
Sally     30
Jess      20
dtype: int64

We can then sum these two Series together to get a new Series ***total_due*** representing the total amount that we owe each person for the two weeks.

In [ ]:
total_due = week_one + week_two
total_due

Bob      600
Sally     80
Jess     320
dtype: int64

In [ ]:
weekone = pd.Series(data=[-29, 1, 20], index =['Reem', 'Dana', 'Ahmed'])
weektwo = pd.Series(data=[-9, 10, -20], index =['Reem', 'Dana', 'Ahmed'])

total_due = weekone + weektwo
total_due

Reem    -38
Dana     11
Ahmed     0
dtype: int64

Notice how the operator (+ in this case) was applied along the corresponding labels.

Awesome! Let's now move on to talk about pandas DataFrames, which builds off of Series and is what we'll be using most throughout the course.

### DataFrames

Formally, a DataFrame is a ***2-dimensional*** labeled data structure with columns of potentially different types. It's probably easiest to think of DataFrames as many Series placed next to each other to share a common index label, but you can also think of them as spreadsheets, SQL tables, or a dictionary of Series objects.

We create a DataFrame using ***pd.DataFrame(data, index, columns)***. ***data*** and ***index*** are pretty familiar to us now that we've seen Series, but what is this new ***columns*** parameter? Well, if you think of DataFrames as many Series placed next to each other to share a common index label, we need some way of accessing each individual Series. This is where ***columns*** comes in. You can think of it as additional lables for each individual Series/column. Let's see an example below.

In [ ]:
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), index=['A', 'B', 'C', 'D'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
print(my_df)
print(type(my_df))

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19
<class 'pandas.core.frame.DataFrame'>

In [ ]:
my_df1 = pd.DataFrame(data=np.arange(0,50,5).reshape(2,5), index=['Name', 'Age', 'Email', 'dob'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
print(my_df1)

ValueError: Shape of passed values is (2, 5), indices imply (4, 5)

Notice the type of what's returned when we access 'col2'. A Series ðŸ˜®, which shouldn't come as too much of a surprise since we mentioned that DataFrames can be thought of as these individual Series placed next to each other to share a common index label.

In [ ]:
print(my_df['col2'])
print(type(my_df['col2']))

A     1
B     6
C    11
D    16
Name: col2, dtype: int64
<class 'pandas.core.series.Series'>

In [ ]:
print(my_df1['col5'])

A     4
B     9
C    14
D    19
Name: col5, dtype: int32

***Note: As mentioned in the Series section, DataFrame index labels will also default to [0, n) if not specified. For example:***

In [ ]:
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), columns=['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
0     0     1     2     3     4
1     5     6     7     8     9
2    10    11    12    13    14
3    15    16    17    18    19

Also, DataFrames will display a lot nicer in jupyter notebooks if you don't call print() on them. ðŸ˜Š

Let's now see how we can access data from these DataFrames.

### DataFrames: Selection

In [ ]:
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), index=['A', 'B', 'C', 'D'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

We can access individual columns using the column names/labels we specified.

In [ ]:
my_df['col2']

A     1
B     6
C    11
D    16
Name: col2, dtype: int64

We can access multiple columns by specifying a list of the column names that we'd like to retrieve.

In [ ]:
my_df[['col2', 'col3']]

   col2  col3
A     1     2
B     6     7
C    11    12
D    16    17

In [ ]:
my_df[['col1', 'col4', 'col2']]

   col1  col4  col2
A     0     3     1
B     5     8     6
C    10    13    11
D    15    18    16

What if we'd like to access row information? We can specify the index location using ***.iloc***, or the index name/label using ***.loc***.

In [ ]:
my_df.iloc[0]

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int64

In [ ]:
my_df.iloc[3,4]

19

In [ ]:
my_df.loc['A']

col1    0
col2    1
col3    2
col4    3
col5    4
Name: A, dtype: int64

In [ ]:
my_df.loc[3, 4]

KeyError: 4

We can grab a section using ***[start_index : stop_index]***. stop_index is not inclusive when using index locations. This should look familiar to how we accessed elements in Numpy arrays.

In [ ]:
my_df.iloc[0:3]

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [ ]:
my_df.iloc[2:4]

   col1  col2  col3  col4  col5
C    10    11    12    13    14
D    15    16    17    18    19

In [ ]:
my_df.loc['A':'C']

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14

In [ ]:
my_df.loc['B':'A']

Empty DataFrame
Columns: [col1, col2, col3, col4, col5]
Index: []

For a section of both rows and columns, we must specify both the row sections of interest and column sections of interest. This should also look familiar to how we accessed row and column sections of interest from 2d Numpy arrays, except we now have to use ***.iloc*** or ***.loc*** depending on how we'd like to specify the rows (by index position or index label/name).

In [ ]:
my_df.iloc[1:4, 0:3]

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

Notice that iloc is for the numbers and location is from the index values.

In [ ]:
my_df.loc['B':'D', 'col1':'col3']

   col1  col2  col3
B     5     6     7
C    10    11    12
D    15    16    17

In [ ]:
my_df.loc['A':'C', 'col1':'col2']

   col1  col2
A     0     1
B     5     6
C    10    11

Recall how we were able to select elements from a Numpy array based off of some condition. The same can be done with DataFrames since our data is essentially just a Numpy array. Let's see a quick example.

In [ ]:
my_df = pd.DataFrame(data=np.arange(0,20).reshape(4,5), index=['A', 'B', 'C', 'D'],
                     columns=['col1', 'col2', 'col3', 'col4', 'col5'])
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

Using comparison operators with our DataFrame, we get back a DataFrame with True/False values indicating whether the value at that position satisfied the condition.

In [ ]:
my_df % 2 == 0

    col1   col2   col3   col4   col5
A   True  False   True  False   True
B  False   True  False   True  False
C   True  False   True  False   True
D  False   True  False   True  False

In [ ]:
my_df % 3 == 1

    col1   col2   col3   col4   col5
A  False   True  False  False   True
B  False  False   True  False  False
C   True  False  False   True  False
D  False   True  False  False   True

So as we saw with Numpy arrays, we can specify this condition as what we would like to select. We'll then get back only the values that met the condition. Those that did not meet the condition will get replaced with NaN representing a missing or empty value.

In [ ]:
my_df[my_df % 2 == 0]

   col1  col2  col3  col4  col5
A   0.0   NaN   2.0   NaN   4.0
B   NaN   6.0   NaN   8.0   NaN
C  10.0   NaN  12.0   NaN  14.0
D   NaN  16.0   NaN  18.0   NaN

In [ ]:
my_df[my_df % 2 == 1]

   col1  col2  col3  col4  col5
A   NaN   1.0   NaN   3.0   NaN
B   5.0   NaN   7.0   NaN   9.0
C   NaN  11.0   NaN  13.0   NaN
D  15.0   NaN  17.0   NaN  19.0

We'll later learn how to properly take care of these NaN values, but we can fill them all with a certain value using ***fillna(value)***. For example:

In [ ]:
# filling all NaN values with 0
my_df[my_df % 2 == 0].fillna(value=0)

   col1  col2  col3  col4  col5
A   0.0   0.0   2.0   0.0   4.0
B   0.0   6.0   0.0   8.0   0.0
C  10.0   0.0  12.0   0.0  14.0
D   0.0  16.0   0.0  18.0   0.0

In [ ]:
my_df[my_df % 2 == 0].fillna(value="meow")

   col1  col2  col3  col4  col5
A   0.0  meow   2.0  meow   4.0
B  meow   6.0  meow   8.0  meow
C  10.0  meow  12.0  meow  14.0
D  meow  16.0  meow  18.0  meow

In [ ]:
# filling all NaN values with whatever the mean of my_df's original col2 is: (1+6+11+16)/4 = 8.5
my_df[my_df % 2 == 0].fillna(value=my_df['col2'].mean())

   col1  col2  col3  col4  col5
A   0.0   8.5   2.0   8.5   4.0
B   8.5   6.0   8.5   8.0   8.5
C  10.0   8.5  12.0   8.5  14.0
D   8.5  16.0   8.5  18.0   8.5

### DataFrames: Adding and Dropping Columns

In [ ]:
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

We can create new columns in a DataFrame by either passing in the new data we would like to store there, or from existing columns/features in our DataFrame. Let's see an example of both cases below.

In [ ]:
my_df['newCol'] = [10, 20, 30, 40]
my_df

   col1  col2  col3  col4  col5  newCol
A     0     1     2     3     4      10
B     5     6     7     8     9      20
C    10    11    12    13    14      30
D    15    16    17    18    19      40

In [ ]:
my_df['newCol'] = [1.0, 2.0, 3.1, 40]
my_df

   col1  col2  col3  col4  col5  newCol
A     0     1     2     3     4     1.0
B     5     6     7     8     9     2.0
C    10    11    12    13    14     3.1
D    15    16    17    18    19    40.0

In [ ]:
my_df['col1+col2'] = my_df['col1'] + my_df['col2']
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2
A     0     1     2     3     4      10          1
B     5     6     7     8     9      20         11
C    10    11    12    13    14      30         21
D    15    16    17    18    19      40         31

In [ ]:
my_df['col1+col2NEW'] = my_df['newCol'] + my_df['col2']
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2NEW
A     0     1     2     3     4     1.0           2.0
B     5     6     7     8     9     2.0           8.0
C    10    11    12    13    14     3.1          14.1
D    15    16    17    18    19    40.0          56.0

What if we want to drop/remove certain column(s)? We can acomplish this using ***drop(columns)***.

In [ ]:
my_df.drop(columns=['newCol'])

   col1  col2  col3  col4  col5  col1+col2
A     0     1     2     3     4          1
B     5     6     7     8     9         11
C    10    11    12    13    14         21
D    15    16    17    18    19         31

Note that these changes are not done inplace. This means that these changes are not permanent. We can see this if we print my_df again.

In [ ]:
my_df

   col1  col2  col3  col4  col5  newCol  col1+col2
A     0     1     2     3     4      10          1
B     5     6     7     8     9      20         11
C    10    11    12    13    14      30         21
D    15    16    17    18    19      40         31

To make these changes permanent, we can supply an additional parameter ***inplace=True***.

In [ ]:
my_df.drop(columns=['newCol', 'col1+col2'], inplace=True)

Now if we print my_df again we can see that the changes were saved. Keep this in mind when you want to modify the original DataFrame.

In [ ]:
my_df

   col1  col2  col3  col4  col5
A     0     1     2     3     4
B     5     6     7     8     9
C    10    11    12    13    14
D    15    16    17    18    19

In [ ]:
my_df.drop(columns=['col1'], inplace=True)

KeyError: "['col1'] not found in axis"

In [ ]:
my_df

   col2  col3  col4  col5  newCol  col1+col2NEW
A     1     2     3     4     1.0           2.0
B     6     7     8     9     2.0           8.0
C    11    12    13    14     3.1          14.1
D    16    17    18    19    40.0          56.0

### DataFrames: Groupby and Common Operations

In [ ]:
my_df = pd.DataFrame({'Type': ['Falcon', 'Falcon', 'Parrot', 'Parrot', 'Cat', 'Cat', 'Cat'],
                      'Max Speed': [380., 370., 24., 26., 50., 50., 150.]})
my_df

     Type  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0
4     Cat       50.0
5     Cat       50.0
6     Cat      150.0

In [ ]:
my_df2 = pd.DataFrame({'Name': ['Reem', 'Dana', 'Ahmed', 'Basel', 'Mona', 'Reyad', 'Jehad'],
                      'Age': [21, 19, 17, 28, 52, 60, 64]})
my_df2

    Name  Age
0   Reem   21
1   Dana   19
2  Ahmed   17
3  Basel   28
4   Mona   52
5  Reyad   60
6  Jehad   64

We'll use this small DataFrame to demonstrate some common operations and useful functions that we can perform on DataFrames. ***my_df*** has 7 observations (0-6) of animals. For each animal, we recorded the type of animal that they are, and their max speed.

Something we'll often like to know is how many unique values are in a certain column. We can achieve this by calling ***unique()*** on our column of interest.

In [ ]:
print(f"unique types: {my_df['Type'].unique()}")
print(f"unique max speeds: {my_df['Max Speed'].unique()}")

unique types: ['Falcon' 'Parrot' 'Cat']
unique max speeds: [380. 370.  24.  26.  50. 150.]

In [ ]:
print(f"unique types: {my_df2['Name'].unique()}")
print(f"unique max speeds: {my_df2['Age'].unique()}")

unique types: ['Reem' 'Dana' 'Ahmed' 'Basel' 'Mona' 'Reyad' 'Jehad']
unique max speeds: [21 19 17 28 52 60 64]

What if we'd like to also know how many of each unique type there are? This can be done by instead calling ***value_counts()***. This will not only tell us how many unique values there are in that column (cat, parrot, and falcon in this case), but also how many of that type we have (3 cats, 2 parrots, and 2 falcons in this DataFrame).

In [ ]:
my_df['Type'].value_counts()

Cat       3
Falcon    2
Parrot    2
Name: Type, dtype: int64

In [ ]:
my_df2['Age'].value_counts()

Age
21    1
19    1
17    1
28    1
52    1
60    1
64    1
Name: count, dtype: int64

We can also do things like get the sum, mean, min, or max of a column:

In [ ]:
print(f"sum of Max Speed col: {my_df['Max Speed'].sum()}")
print(f"mean of Max Speed col: {my_df['Max Speed'].mean()}")
print(f"min from Max Speed col: {my_df['Max Speed'].min()}")
print(f"max from Max Speed col: {my_df['Max Speed'].max()}")

sum of Max Speed col: 1050.0
mean of Max Speed col: 150.0
min from Max Speed col: 24.0
max from Max Speed col: 380.0

In [ ]:
print(f"mean of Age col: {my_df2['Age'].mean()}")

mean of Age col: 37.285714285714285

What if we wanted to know the mean Max Speed for each group of animals? This is where a function called ***groupby(by)*** will come in handy. This will group all common types together and then allow us to apply a function like mean to each group. For example:

In [ ]:
# This grouped all cats together, all falcons together, all parrots together and then applied the mean function
# to each groups columns (only Max Speed in this case). So we can see that the mean Max Speed for all cats in this 
# DataFrame is 83.333333.
my_df.groupby(by='Type').mean()

         Max Speed
Type
Cat      83.333333
Falcon  375.000000
Parrot   25.000000

***Note that here we grouped by the 'Type' column, but we could specify a different column if we wanted to. Just make sure that you group by something that makes sense.***

### Extra Practice

Let's now see how we can explore and modify datasets using pandas.

We'll be looking at a [pokemon dataset](https://www.kaggle.com/abcsds/pokemon), which contains the following attributes:
- #: ID for each pokemon
- Name: Name of each pokemon
- Type 1: Each pokemon has a type, this determines weakness/resistance to attacks
- Type 2: Some pokemon are dual type and have 2
- Total: sum of all stats that come after this, a general guide to how strong a pokemon is
- HP: hit points, or health, defines how much damage a pokemon can withstand before fainting
- Attack: the base modifier for normal attacks (eg. Scratch, Punch)
- Defense: the base damage resistance against normal attacks
- SP Atk: special attack, the base modifier for special attacks (e.g. fire blast, bubble beam)
- SP Def: the base damage resistance against special attacks
- Speed: determines which pokemon attacks first each round

We'll typically be reading in an existing dataset from our computer, which pandas will then convert into a beautiful DataFrame for us rather than having to create the whole thing from scratch like we did in this lab. To do this, we'll use ***pd.read_csv(filepath_or_buffer)***. If the dataset is located in the same directory as this jupyter notebook, we can simply provide the name of our dataset file into the ***filepath_or_buffer*** parameter. Otherwise we'll have to specify the path to this file.

In [ ]:
pokemon_df = pd.read_csv(filepath_or_buffer='Pokemon.csv')

After reading, we can get a preview of this dataset using ***head()***. This will show us the first 5 values in the dataset.

In [ ]:
pokemon_df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

We can then print a concise summary of our pokemon DataFrame using ***info()***. The info below lets us know that we have 800 entries, and how many non-null values are in each feature/column. Since the Type 2 column only contains 414 non-null values, there are 386 missing values in this column. We'll want to take care of this since we don't like to have missing values.

In [ ]:
pokemon_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 800 entries, 0 to 799
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   #           800 non-null    int64
 1   Name        800 non-null    object
 2   Type 1      800 non-null    object
 3   Type 2      414 non-null    object
 4   Total       800 non-null    int64
 5   HP          800 non-null    int64
 6   Attack      800 non-null    int64
 7   Defense     800 non-null    int64
 8   Sp. Atk     800 non-null    int64
 9   Sp. Def     800 non-null    int64
 10  Speed       800 non-null    int64
 11  Generation  800 non-null    int64
 12  Legendary   800 non-null    bool
dtypes: bool(1), int64(9), object(3)
memory usage: 75.9+ KB

As you'll learn in lecture, there are many ways to handle missing data. I'll list some options down below for both categorical and quantitative variables.

Some options for categorical variables include:
- Remove observations with missing values if we are dealing with a large dataset and the number of records containing missing values are few. 
- Remove the variable/column if it is not significant.
- Develop a model to predict missing values. KNN for example. 
- Replace missing values with the most frequent in that column. 

Some options for quantitative variables include:
- Remove the variable/column if it is not significant.
- Impute missing values with something like the mean/average value in that column.
- Develop a model to predict missing values.

***Note: There is not one single method that will work for every case. Determining how you'll handle missing data will vary between datasets.***

Here we will keep it simple and simply fill missing values with their corresponding Type 1 value.

In [ ]:
pokemon_df['Type 2'].isna().sum()

386